In [27]:
import pandas as pd

In [28]:
# Sample DataFrame
data = {
    'Class': ['Math', 'Science', 'Math', 'Science', 'Math', 'Science'],
    'Score': [85, 90, 78, 88, 92, 95]
}
df = pd.DataFrame(data)
df

     Class  Score
0     Math     85
1  Science     90
2     Math     78
3  Science     88
4     Math     92
5  Science     95

In [29]:
df['Class']

0       Math
1    Science
2       Math
3    Science
4       Math
5    Science
Name: Class, dtype: object

In [30]:
s_index = pd.Series(data=[2,4], index=['a','b'])
s_index

a    2
b    4
dtype: int64

In [31]:
df.loc[s_index,'Class']

2    Math
4    Math
Name: Class, dtype: object

In [32]:
df

     Class  Score
0     Math     85
1  Science     90
2     Math     78
3  Science     88
4     Math     92
5  Science     95

In [33]:
def map_names_to_number(class_name):
    return mapping[class_name]


# map_names_to_number = lambda class_name:mapping[class_name]
# map class names to
mapping ={
    'Math':1,
    'Science':2,
}

class_name = 'Math'

map_names_to_number(class_name)

1

In [34]:
df['Class'] = df['Class'].apply( lambda class_name:mapping[class_name] )
df

   Class  Score
0      1     85
1      2     90
2      1     78
3      2     88
4      1     92
5      2     95